#include <bits/stdc++.h>

using namespace std;

/* <=150 0.4463
 * 151--400 0.4663
 * 400+ 0.5663
 *
 * */


// 需要对结果进行四舍五入  floor函数 返回不大于传入参数的的最大整数
//  (b*10+0.5)/10.0  对小数点第一位进行四舍五入  若是整数部分，则 (int)(b+0.5)即可
int main() {
    int n;
    cin >> n;
    if (n > 400) cout << floor((150 * 0.4463 + (400 - 150) * 0.4663 + (n - 400) * 0.5663) * 10 + 0.5) / 10.0;
    else if (n > 150) cout << floor((150 * 0.4463 + (n - 150) * 0.4663) * 10 + 0.5) / 10.0;
    else cout << floor((n * 0.4463) * 10 + 0.5) / 10.0;
    return 0;
}

